kisgoody/CirrusLogic/CRD42L42-MFi/MCU Firmware/STM8L10x_LAM_init_test/system.c
#include "stm8l10x.h"
#include "system.h"
#include "i2c_master_poll.h"

// headset jack action function ------------------------------------------------
// if state has changed
// if something is plugged in, determine it's type
// if nothing is plugged in, inform LAM
uint8_t next_plug_state (uint8_t current_plug_state)
{

	uint8_t temp_state;
	uint8_t i;

	temp_state = current_plug_state;				// latch current state
		//using global Tip_plugged instead of current_plug_state

	if (!Tip_plugged) {												//flag shows not plugged
			if (GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_1) != RESET){		//true when plugged
				Tip_plugged = 1;								// set flag showing plugged 
				temp_state = 1;
				//codec_init ();									// initialize codec
				//codec_pwr_dn ();
				hs_type_det ();
				//codec_init ();									// initialize codec
				//codec_pwr_up();
				DAC_EN = 0; 							//next lamInformation will set LEDs
				pending_en_ch = 1;
				for (i = 0; i < 13; i++) wait_15ms ();			// wait for control port (195 ms)
				//codec_pwr_dn ();
			} 
	}	else {														//Tip_plugged
			if (GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_1) == RESET){	//true when not plugged
				//it was previously plugged but now it is not
				Tip_plugged = 0;							// reset flag 
				temp_state = 0;
				pending_en_ch = 1;
				GPIO_ResetBits (GPIOB, GPIO_Pin_6);		// green OFF
				GPIO_ResetBits (GPIOB, GPIO_Pin_5);		// red OFF
				DAC_EN = 0; 							//next lamInformation will set LEDs
				ADC_EN = 0; 							//next lamInformation will set LEDs
				HP_Only = 1;									// no mic
				// unplug
				codec_reg_write (0x00, 0x1b);					//set page
				codec_reg_write (0x70, 0x03);					// Reset Auto HSBIAS Clamp = Current Sense
			} 
	}

	// determine if state must change

	return (temp_state);

} // --------------------------------------------------------------------------


// side button action function ------------------------------------------------
// if button is pressed set the pending_launch flag and change button_state to 0
// if button is released set button_state back to 1
uint8_t next_button_state (uint8_t current_button_state)
{

	uint8_t temp_state;

	temp_state = current_button_state;				// latch current state

	// determine if state must change
	if (temp_state)									// button thought to be released (1)
	{
		// check for press
		if (GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_4) == RESET)
		{
			wait_15ms ();							// delay (debounce)
			// check if button is still pressed
			if (GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_4) == RESET)
			{
				temp_state = 0;						// change state to pressed (0)
				pending_launch = 1;				// flag set
			} // if (actually pressed)
		} // if (possibly pressed)
	} else {										// button thought to be pressed (0)
		// check for release
		if (GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_4) != RESET)
		{
			wait_15ms ();							// delay (debounce)
			// check if button is still released
			if (GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_4) != RESET)
			{
				temp_state = 1;						// change state to released (1)
			} // if (actually released)
		} // if (possibly released)
	} // if (state)

	return (temp_state);

} // --------------------------------------------------------------------------

// spare button action function ------------------------------------------------
// if button is pressed enable talk-through
// if button is released set button_state back to 1

uint8_t next_sp_button_st (uint8_t current_sp_button_st)
{

	uint8_t i;
	uint8_t temp_state;
	uint8_t cdc_conf_done;							//indicate that the codec has been configured

	temp_state = current_sp_button_st;				// latch current state
/*
	// determine if state must change
	if (temp_state)									// button thought to be released (1)
	{
		// check for press
		if (GPIO_ReadInputDataBit (GPIOA, GPIO_Pin_2) == RESET)
		{
			for (i = 0; i < 13; i++) wait_15ms ();			// wait for control port (195 ms)
			// check if button is still pressed
			if (GPIO_ReadInputDataBit (GPIOA, GPIO_Pin_2) == RESET)
			{
				//The codec may have been powered down by: 	case lamInformation
				if (!DAC_EN)   //initialize codec if it's been powered down
				{
					codec_pwr_up();
				}
				// codec_talk_thru
				// enable talk-through
				codec_reg_write (0x00, 0x1B);					// set page 0x1B
				codec_reg_write (0x74, 0x07);					// enable HS_BIAS
				
				codec_reg_write (0x00, 0x1D);					// set page 0x1D
				codec_reg_write (0x04, 0x79);					//ADC wind noise filter enabled 
																							//the code is not shutting off the WNF
				codec_reg_write (0x00, 0x23);					// set page 0x23
				codec_reg_write (0x01, 0xFF);					//CHA_Vol = MUTE
				codec_reg_write (0x03, 0xFF);					//CHB_Vol = MUTE
				codec_reg_write (0x00, 0x1D);					// set page 0x1D
//				codec_reg_write (0x02, 0x06);					//ADC soft-ramp enable
				codec_reg_write (0x03, 0x06);					//ADC_VOL = 6dB,
				codec_reg_write (0x01, 0x01);					//ADC_DIG_BOOST; +20dB, 
				codec_reg_write (0x00, 0x23);					// set page 0x23
				codec_reg_write (0x02, 0x00);					//ADC_Vol = 0dB, 

				while (GPIO_ReadInputDataBit (GPIOA, GPIO_Pin_2) == RESET)
					{
						wait_15ms ();							// delay (debounce)
					}	
				//button was released
				//no need to change temp_state as it's already (1)
				//GPIO_ResetBits (GPIOB, GPIO_Pin_7);  // reset codec
				//codec_init ();									// initialize codec
				//volume will be configured by next lamAudioTerminalInformation
				ADC_pwr_dn ();						//ADC has now been turned off
			} // if (actually pressed)
		} // if (possibly pressed)
	} else {										// button thought to be pressed (0)
		// check for release
		if (GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_4) != RESET)
		{
			wait_15ms ();							// delay (debounce)
			// check if button is still released
			if (GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_4) != RESET)
			{
				temp_state = 1;						// change state to released (1)
			} // if (actually released)
		} // if (possibly released)
	} // if (state)
*/
	return (temp_state);

} // --------------------------------------------------------------------------



