kisgoody/CirrusLogic/CRD42L42-MFi/MCU Firmware/STM8L10x_LAM_init_test/system.c
	// unplug
	codec_reg_write (0x00, 0x1b);					//set page
	codec_reg_write (0x70, 0x03);					// Reset Auto HSBIAS Clamp = Current Sense
	
	
	codec_reg_write (0x20, 0x80);					//HSDET mode set to auto, disabled
	// If headset type 1-3 is detected, the switches are set automatically.


	//codec_reg_write (0x00, 0x11);					// set page 0x11
	//temp_rd = codec_reg_read (0x24);			//was 0x24
	// Decode HSDET_TYPE
	Optical_Only = 0;							          //start with assumption
	HP_Only = 0;							          //start with assumption
	if (temp_rd & 0x01){
	} else {
		HP_Only = 1;							          //possibly HP_Only
	}	
	if (temp_rd & 0x02){
		Optical_Only = (temp_rd & 0x1);			//Only set if both bits are 1
	} else {
		HP_Only = 0;							          // a mic is present
	}	
	for (i = 0; i < 8; i++) wait_15ms ();			// wait for control port (120 ms)
/*
	//After type detection - initiate load detection 
	codec_reg_write (0x00, 0x11);					// set page 0x11
	codec_reg_write (0x01, 0xFE);					//codec is powered up
	codec_reg_write (0x00, 0x1B);					// set page 0x1B
	codec_reg_write (0x74, 0x01);					//Set HSBIAS_CTRL to Hi-Z Mode
	codec_reg_write (0x00, 0x11);					// set page 0x11
	codec_reg_write (0x01, 0x04);					//Set ADPTPWR to Fixed, Mode 3
	codec_reg_write (0x00, 0x10);					// set page 0x10
	codec_reg_write (0x0A, 0x71);					//Set the analog and digital soft ramp rates
	codec_reg_write (0x00, 0x19);					// set page 0x19
	codec_reg_write (0x27, 0x01);					//Enable HP load detect
	//Read HPLOAD_DET_DONE until value is 1
	do
	{
		temp_rd = codec_reg_read  (0x26);			// read 0x1926
		if ((temp_rd & 0x01) == 0x01){		//test bit 0
			auto_done = 1;									// set flag showing it completed
		} else {
			wait_15ms ();							// delay 
		}	
	} while (!auto_done);					//wait until HSDET logic has finished its detection cycle
	codec_reg_write (0x00, 0x19);					// set page 0x19
	temp_rd = codec_reg_read (0x25);
	//Set HPOUT_LOAD according to CLA_STAT
	if (temp_rd & 0x10){		//test bit 4
		D_CTRL_2 = 0x09;									// set for 10-nF mode
	} else {
		D_CTRL_2 = 0x01;									// set for 1-nF mode
	}	
	codec_reg_write (0x00, 0x21);					// set page 0x21
	codec_reg_write (0x01, 0x07);					//Restore ADPTPWR Adapt-to-Signal Mode
	codec_reg_write (0x00, 0x1B);					// set page 0x1B
	codec_reg_write (0x74, 0x07);					//Set HSBIAS_CTRL to 2.7V Mode
	codec_reg_write (0x00, 0x11);					// set page 0x11
	codec_reg_write (0x01, 0xF6);					//Power up the HP again.
	codec_reg_write (0x00, 0x10);					// set page 0x10
	codec_reg_write (0x0A, 0xA4);					//Set the analog and digital soft ramp rates
	codec_reg_write (0x00, 0x19);					// set page 0x19
	codec_reg_write (0x27, 0x00);					//Disable HP load detection
	codec_reg_write (0x25, 0x1F);					//Clear latch to VP
*/	
	
	codec_reg_write (0x00, 0x1B);					// set page 0x1B
	codec_reg_write (0x74, 0x01);					//Turn off HSBIAS until requested by ADC
	

	


} // --------------------------------------------------------------------------


// codec I2C register write function (single) ---------------------------------
void codec_reg_write (uint8_t reg, uint8_t value)
{

	// issue I2C write with length equal to 1
	codec_reg_write_mult (reg, 1, &value);

} // --------------------------------------------------------------------------


// codec I2C register write function (multiple) -------------------------------
void codec_reg_write_mult (uint8_t reg, uint8_t length, uint8_t *payload)
{

	// issue I2C write if programming shunt is absent
	I2C_WriteRegister (reg, length, payload);

} // --------------------------------------------------------------------------


// codec I2C register read function (single) ----------------------------------
uint8_t codec_reg_read (uint8_t reg)
{

	uint8_t temp_read;
	temp_read = 0x00;

	// fetch I2C read with length equal to 1
	codec_reg_read_mult (reg, 1, &temp_read);

	return (temp_read);

} // --------------------------------------------------------------------------


// codec I2C register read function (multiple) --------------------------------
void codec_reg_read_mult (uint8_t reg, uint8_t length, uint8_t *payload)
{

	// fetch I2C read if programming shunt is absent
	I2C_ReadRegister (reg, length, payload);

} // --------------------------------------------------------------------------